{
  "backend/main.mo": "Defines backend types and state for site content, riders, applications, and delivery orders with admin‑gated initialization and mixins for auth and storage.",
  "backend/migration.mo": "Provides a no-op migration function that returns the input state unchanged.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries of many frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base configuration defining CSS variables for theming, including light and dark mode palettes.",
  "frontend/index.html": "HTML entry point setting meta tags, app title, and loading the root React application.",
  "frontend/src/App.tsx": "Configures routing, theming, and React Query providers, defining all main site routes within a shared layout.",
  "frontend/src/components/admin/AdminOrdersPanel.tsx": "Admin panel to view, create, update, assign, and manage delivery orders with dialogs and mutations.",
  "frontend/src/components/admin/AdminRidersPanel.tsx": "Shows a table of rider profiles with details like mobile, area, bike availability, and assigned orders.",
  "frontend/src/components/AdminGuard.tsx": "Restricts access to admin pages by checking user role and showing an access denied message if not authorized.",
  "frontend/src/components/BrandLogo.tsx": "Renders the brand logo image with title and tagline text.",
  "frontend/src/components/FloatingWhatsAppCTA.tsx": "Displays a fixed WhatsApp contact button linking to a prefilled message.",
  "frontend/src/components/FounderCard.tsx": "Shows a founder profile card with image fallback, role, and a short message.",
  "frontend/src/components/GradientSection.tsx": "Wraps content in themed gradient or translucent background sections based on variant selection.",
  "frontend/src/components/HeaderNav.tsx": "Responsive header with navigation links, contact buttons, and a mobile sheet menu.",
  "frontend/src/components/HomeServicesCategories.tsx": "Displays a grid of service categories with icons, titles, and descriptions.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity authentication with status feedback.",
  "frontend/src/components/MapEmbed.tsx": "Embeds a Google Maps iframe showing Bikaner location within a styled container.",
  "frontend/src/components/PrimaryCTAs.tsx": "Provides primary call-to-action buttons for WhatsApp ordering and phone calls.",
  "frontend/src/components/ProofAndTrustSection.tsx": "Shows trust-building features in cards highlighting proof of delivery and updates.",
  "frontend/src/components/RateTable.tsx": "Renders a table of distance-based parcel rates with formatted prices.",
  "frontend/src/components/RiderApplicationSection.tsx": "Rider application form with validation, modal dialog, and mutation submission.",
  "frontend/src/components/RiderGuard.tsx": "Protects rider-only routes by requiring authentication and showing login prompt.",
  "frontend/src/components/ServiceList.tsx": "Grid of service offering cards with icons, titles, and short descriptions.",
  "frontend/src/components/SiteFooter.tsx": "Footer with brand info, quick links, contact details, and CTA buttons.",
  "frontend/src/components/SiteLayout.tsx": "Page layout wrapper including header, footer, and floating WhatsApp CTA.",
  "frontend/src/components/Steps.tsx": "Displays a responsive grid of step cards showing number, title, and description.",
  "frontend/src/config/contact.ts": "Provides centralized contact config and a helper to build WhatsApp links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login handling, identity persistence, and provider setup.",
  "frontend/src/hooks/usePageMeta.ts": "Updates document title and meta tags for description and keywords.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating site content, rates, users, riders, and orders.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color themes with light/dark mode and gradient utilities.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing site content, delivery rates, orders, and rider applications with CRUD actions and tabbed UI.",
  "frontend/src/pages/ContactPage.tsx": "Contact page showing phone, WhatsApp options, and a form that opens a prefilled WhatsApp message using a template.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero section, WhatsApp booking link, service highlights, and promotional sections like trust proof and rider applications.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains the delivery process in four steps with visual cards and additional details on benefits and transparency.",
  "frontend/src/pages/RateCardPage.tsx": "Displays distance‑based delivery pricing fetched from the backend along with notes about fuel efficiency and transparent rates.",
  "frontend/src/pages/RiderPage.tsx": "Rider portal page that lists assigned deliveries, allows status updates, and supports proof‑of‑delivery photo uploads with progress tracking.",
  "frontend/src/pages/ServicesPage.tsx": "Services overview page showing delivery categories with metadata setup and a gradient-themed layout.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, retrieving, and clearing URL and session-based parameters, including hash‑based routing support.",
  "frontend/src/utils/whatsapp.ts": "Functions to generate WhatsApp message links and format Indian phone numbers.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and content paths for the project.",
  "project_state.json": "Project metadata describing features, design goals, images, and architectural notes for the Bikaner Express Delivery site."
}