{
  "backend/main.mo": "Motoko backend defining delivery data types, storing site content, rider applications, and orders with admin‑protected initialization and storage mixins.",
  "feature_evidence.json": "Feature evidence report linking a rebuild/redeploy trigger to related files, components, and test metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of all frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind CSS root theme variables and global styles defining light/dark themes and base styling.",
  "frontend/index.html": "HTML entry file setting metadata and mounting the React app via main.tsx.",
  "frontend/redeploy-trigger.txt": "Plain text marker indicating when a rebuild and deployment were triggered.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router, React Query, theming, and route structure.",
  "frontend/src/components/admin/AdminOrdersPanel.tsx": "Admin panel for listing, creating, updating, assigning riders to orders, and uploading delivery proofs using various query hooks.",
  "frontend/src/components/admin/AdminRidersPanel.tsx": "Displays a table of rider profiles with basic details and assigned order counts fetched from the backend.",
  "frontend/src/components/AdminGuard.tsx": "Wrapper component that checks user role and blocks access to admin pages if not authorized.",
  "frontend/src/components/BrandLogo.tsx": "Displays the site’s logo image with brand name and tagline.",
  "frontend/src/components/FloatingWhatsAppCTA.tsx": "Floating WhatsApp button linking to a prefilled message for quick contact.",
  "frontend/src/components/FounderCard.tsx": "Card showing founder details with fallback avatar handling.",
  "frontend/src/components/GradientSection.tsx": "Section wrapper applying selectable gradient or blurred card backgrounds.",
  "frontend/src/components/HeaderNav.tsx": "Responsive navigation bar with links, mobile menu, and call/WhatsApp CTAs.",
  "frontend/src/components/HomeServicesCategories.tsx": "Displays a grid of service category cards with icons, titles, and descriptions.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with automatic session handling.",
  "frontend/src/components/MapEmbed.tsx": "Embeds a Google Maps iframe showing the Bikaner location.",
  "frontend/src/components/PrimaryCTAs.tsx": "Renders WhatsApp and phone call CTA buttons for ordering.",
  "frontend/src/components/ProofAndTrustSection.tsx": "Shows trust features in a grid of cards with icons and descriptions.",
  "frontend/src/components/RateTable.tsx": "Displays distance-based pricing in a table with formatted parcel rates.",
  "frontend/src/components/RiderApplicationSection.tsx": "Implements a modal form for riders to apply, with validation and submission handling.",
  "frontend/src/components/RiderGuard.tsx": "Protects rider-only pages by requiring login and showing a prompt if unauthenticated.",
  "frontend/src/components/ServiceList.tsx": "Shows a list of service offering cards with icons and brief descriptions.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with branding, quick links, contact details, and CTAs.",
  "frontend/src/components/SiteLayout.tsx": "Defines the site’s main layout with header, footer, and floating WhatsApp CTA.",
  "frontend/src/components/Steps.tsx": "Displays a multi-step process as numbered cards with titles and descriptions.",
  "frontend/src/config/contact.ts": "Defines central contact info and provides a helper to generate WhatsApp message links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and invalidates queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and utilities for managing Internet Identity authentication state.",
  "frontend/src/hooks/usePageMeta.ts": "Hook that updates document title and meta tags for description and keywords.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating site content, rates, orders, riders, and related backend data.",
  "frontend/src/index.css": "Tailwind base styles and custom theme variables for light/dark modes including gradients and UI utilities.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard allowing content editing, rate management, and viewing rider applications and orders via multiple panels and forms.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with call/WhatsApp options and a form that opens a prefilled WhatsApp message using a server-provided template.",
  "frontend/src/pages/HomePage.tsx": "Homepage featuring a hero section, WhatsApp booking CTA, service highlights, and various promotional sections about the delivery service.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains the four-step delivery process with icons and supporting sections describing benefits and workflows.",
  "frontend/src/pages/RateCardPage.tsx": "Displays fuel-efficiency info and a dynamic table of distance‑based delivery rates fetched from the backend.",
  "frontend/src/pages/RiderPage.tsx": "Rider dashboard to view assigned deliveries, update statuses, and upload proof photos with progress tracking.",
  "frontend/src/pages/ServicesPage.tsx": "Services listing page showing delivery categories with metadata setup.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/whatsapp.ts": "Functions to build WhatsApp message links and format Indian phone numbers.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and content paths.",
  "project_state.json": "Metadata describing project state, features, and pending rebuild/redeploy request."
}