{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Bikaner Express Delivery: vibrant marketing site + Admin & Rider portals (frontend-only plan)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Refresh the marketing site UI to a modern energetic gradient theme with smooth animations and colorful section backgrounds throughout public pages.",
      "acceptanceCriteria": [
        "All primary sections across Home/Services/How It Works/Rate Card/Contact use colorful/gradient backgrounds behind text (no large plain-white content slabs).",
        "Buttons/cards/links have consistent hover + focus states and subtle motion (e.g., lift/scale/shine) without harming readability.",
        "Layout is mobile-first and remains visually strong on small screens (no cramped hero, CTAs remain prominent)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Enhance global gradient/texture utilities and add reusable animation utilities (e.g., subtle float/shine/lift) to support the vibrant red/orange/black/white delivery theme."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind theme with additional brand gradient colors and keyframe animations for hover/motion effects used across marketing pages."
        },
        {
          "path": "frontend/src/components/GradientSection.tsx",
          "operation": "create",
          "description": "Create a reusable section wrapper that applies colorful/gradient backgrounds and consistent padding/spacing so public pages avoid plain white blocks."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Refactor Home sections to use GradientSection and apply consistent motion/hover styling for cards/CTAs while keeping readability on gradients."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Update Services page layout to use colorful/gradient section backgrounds and consistent hover/focus states for service cards."
        },
        {
          "path": "frontend/src/pages/HowItWorksPage.tsx",
          "operation": "modify",
          "description": "Update How It Works page sections to use colorful/gradient backgrounds and add subtle motion on step cards/CTAs."
        },
        {
          "path": "frontend/src/pages/RateCardPage.tsx",
          "operation": "modify",
          "description": "Update Rate Card page sections to use colorful/gradient backgrounds and improve table readability on mobile with brand styling."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Update Contact page sections to use colorful/gradient backgrounds and ensure cards/inputs remain readable with consistent hover/focus visuals."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Revise the Home hero to the exact requested tagline, include rider illustration + bike animation, and add the two required CTAs.",
      "acceptanceCriteria": [
        "Home hero displays the exact tagline text with the bullet separators (•).",
        "Two hero CTAs are visible above-the-fold on mobile: one opens WhatsApp chat, one routes to /rate-card.",
        "A rider illustration is visible in the hero and a bike animation is present (e.g., subtle looping movement)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/rider-illustration.dim_1200x900.png",
          "operation": "create",
          "description": "Add the generated rider illustration asset and keep it available as a static public asset for the Home hero."
        },
        {
          "path": "frontend/public/assets/generated/bike-illustration.dim_900x450.png",
          "operation": "create",
          "description": "Add the generated bike illustration asset and keep it available as a static public asset for the Home hero animation."
        },
        {
          "path": "frontend/public/assets/generated/speed-gradient-bg.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated abstract fast-delivery gradient background texture asset for use behind the Home hero."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update hero layout to display the exact tagline “Fast • Local • Trusted Delivery in Bikaner”, place the rider illustration, and render a subtly looping bike animation; replace hero CTAs with “Book Delivery on WhatsApp” (new tab) and “Check Rates” (route to /rate-card)."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust a lightweight CSS animation utility used for the hero bike looping motion and CTA hover effects."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure a site-wide WhatsApp floating button and consistent WhatsApp number across header, hero, contact, and floating CTA.",
      "acceptanceCriteria": [
        "Floating WhatsApp CTA is present on every route (Home, Services, How It Works, Rate Card, Contact, Admin, Rider).",
        "All WhatsApp links point to the same configured WhatsApp number and open in a new tab/window.",
        "No page contains a mismatched phone/WhatsApp number compared to the configured values."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/contact.ts",
          "operation": "create",
          "description": "Centralize configured contact phone and WhatsApp number in one place so Header, hero, Contact page, footer, and FloatingWhatsAppCTA all reference the same values."
        },
        {
          "path": "frontend/src/components/FloatingWhatsAppCTA.tsx",
          "operation": "modify",
          "description": "Update the floating CTA to build its WhatsApp link using the centralized configured WhatsApp number and ensure it always opens in a new tab/window."
        },
        {
          "path": "frontend/src/components/HeaderNav.tsx",
          "operation": "modify",
          "description": "Replace hardcoded tel/WhatsApp links with centralized configured values and ensure both desktop and mobile CTAs use the same WhatsApp number."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Ensure hero “Book Delivery on WhatsApp” uses the same centralized WhatsApp number as the header/footer/floating button and opens in a new tab/window."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Update contact WhatsApp card and the form submission WhatsApp link generation to use the centralized WhatsApp number (no per-page hardcoding)."
        },
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Update footer phone/WhatsApp links to use centralized configured values so numbers cannot drift across the site."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Convert all user-facing marketing copy to English while aligning to fast/local/trustworthy positioning and proof-of-delivery messaging.",
      "acceptanceCriteria": [
        "Public marketing pages contain English copy (no Hindi/Hinglish sentences in headings, paragraphs, or CTAs).",
        "Key promises (speed, trust, photo proof delivery) are clearly communicated in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Rewrite remaining Hinglish sections into clear English copy aligned to fast/local/trustworthy positioning, including proof-of-delivery value props."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Update headings, descriptions, feature paragraphs, and CTAs to English; keep delivery positioning consistent."
        },
        {
          "path": "frontend/src/pages/HowItWorksPage.tsx",
          "operation": "modify",
          "description": "Update step titles/descriptions and detailed process content to English, emphasizing photo proof and WhatsApp coordination."
        },
        {
          "path": "frontend/src/pages/RateCardPage.tsx",
          "operation": "modify",
          "description": "Update Rate Card page copy to English while keeping it concise and trustworthy."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Update Contact page supporting text, card descriptions, and form helper text to English."
        },
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Update footer paragraph and CTA text to English (remove Hinglish lines)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add/adjust homepage sections: About, Services categories, Rate Card preview/link, Founder section with photo, and Proof & Trust section describing photo proof + WhatsApp confirmation + coordination.",
      "acceptanceCriteria": [
        "Homepage contains clearly labeled sections corresponding to About, Services, Founder, and Proof & Trust.",
        "Services section includes all five requested service categories explicitly.",
        "Founder section displays the founder name exactly as provided and shows a photo component with a graceful placeholder/fallback."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FounderCard.tsx",
          "operation": "create",
          "description": "Create a dedicated Founder section component that renders the founder name “Sarwan Singh Rathore”, a photo area, and a short trust-building message with a graceful placeholder fallback."
        },
        {
          "path": "frontend/src/components/ProofAndTrustSection.tsx",
          "operation": "create",
          "description": "Create a homepage section component describing delivery photo proof, WhatsApp confirmation, and real-time coordination in concise English."
        },
        {
          "path": "frontend/src/components/HomeServicesCategories.tsx",
          "operation": "create",
          "description": "Create a homepage-only services categories section that explicitly lists: Local shop delivery, Bus parcel delivery, Documents & medicines, Same-day local delivery, Village & dhani delivery."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add/adjust homepage sections for About Company, Services categories, Rate Card preview/link, Founder section, and Proof & Trust; ensure each section uses colorful/gradient backgrounds per design requirements."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add a “Join as a Rider” section and application form (Name, Mobile, Bike yes/no, Area) that submits to backend and is reviewable in Admin UI.",
      "acceptanceCriteria": [
        "Rider application form validates required fields and submits successfully.",
        "Backend stores rider applications and returns them via an admin-only query endpoint.",
        "Admin UI lists rider applications with the submitted fields and submission timestamp."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RiderApplicationSection.tsx",
          "operation": "create",
          "description": "Create a “Join as a Rider” section with an “Apply as Rider” button and a simple validated form (Name, Mobile, Bike available Yes/No, Area) that submits via existing backend capabilities."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for rider applications: submit application and admin list retrieval, wiring to existing backend capabilities."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add the RiderApplicationSection to the homepage in a branded gradient section, keeping the form mobile-first and easy to complete."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Add an Admin section that lists rider applications (name, mobile, area, hasBike, submission time) for review."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Update the Rate Card page to include a clear pricing table and a visible note about fuel-efficient bike delivery (“40 km average”).",
      "acceptanceCriteria": [
        "Rate card displays a readable pricing table on mobile and desktop.",
        "A visible note mentions \"40 km average\" fuel-efficient bike delivery."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RateCardPage.tsx",
          "operation": "modify",
          "description": "Add a prominent note mentioning “40 km average” fuel-efficient bike delivery and adjust layout for clarity and mobile readability."
        },
        {
          "path": "frontend/src/components/RateTable.tsx",
          "operation": "modify",
          "description": "Improve mobile table responsiveness and visual clarity (spacing, typography, container overflow) while keeping it consistent with the new vibrant theme."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Expand the Admin dashboard UI for orders workflow: create/view/edit orders, assign riders, update statuses, upload/view proof photos, and manage customer contact details (admin-only).",
      "acceptanceCriteria": [
        "Admin route remains protected so non-admin users cannot access it.",
        "Admin can create an order with customer contact details and initial status Pending.",
        "Admin can assign an order to a rider and change status among Pending/Picked/Delivered.",
        "Admin can upload one or more proof photos against an order and later view/download them."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks/mutations for admin order workflow (list orders, create/edit, assign rider, update status, upload and fetch delivery proof), using existing backend capabilities. Use the blob-storage component ExternalBlob to support proof photo upload/view; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminOrdersPanel.tsx",
          "operation": "create",
          "description": "Create an admin-only orders panel UI for order creation/editing, rider assignment, and status updates, plus proof photo upload and preview. Use the blob-storage component ExternalBlob for proof photo handling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminRidersPanel.tsx",
          "operation": "create",
          "description": "Create an admin-only riders panel UI for viewing rider profiles (and any available assignment/role actions exposed by backend capabilities). Use the authorization component patterns for role gating; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Integrate AdminOrdersPanel/AdminRidersPanel and rider applications review into the Admin page, while keeping existing site content + rate management intact. Ensure admin-only gating remains enforced via AdminGuard and LoginButton."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Create a Rider portal with Internet Identity login that shows assigned deliveries, allows status updates, and supports proof photo upload for assigned orders only (role-gated).",
      "acceptanceCriteria": [
        "A dedicated Rider route exists (e.g., /rider) with login and role gating.",
        "Riders only see orders assigned to them.",
        "Riders can update status and upload proof photos; uploads are rejected by the backend if the rider is not assigned to that order."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RiderPage.tsx",
          "operation": "create",
          "description": "Create a Rider Portal page that uses Internet Identity login to list assigned deliveries and provides controls to update status (Pending/Picked/Delivered) and upload proof photos for assigned orders. Use the blob-storage component ExternalBlob to support proof photo upload; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/RiderGuard.tsx",
          "operation": "create",
          "description": "Add a RiderGuard wrapper that requires login and performs role gating using the authorization component role-checking patterns; show an access denied state when unauthorized. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add rider-specific query/mutation hooks for listing assigned deliveries, updating delivery status, and uploading proof photos, wiring to existing backend capabilities. Use the authorization component guidance for authenticated data fetching and cache clearing; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register and wire the new /rider route to RiderPage so it is navigable."
        },
        {
          "path": "frontend/src/components/HeaderNav.tsx",
          "operation": "modify",
          "description": "Add a Rider Portal navigation link (e.g., “Rider”) to the header navigation/menu for easy access."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Embed Google Maps on Contact page and optimize SEO metadata for the exact phrase “Bikaner delivery service” globally and per page.",
      "acceptanceCriteria": [
        "Contact page displays a Google Maps embed without layout overflow on mobile.",
        "Site metadata (including at least homepage title/description and global keywords) includes \"Bikaner delivery service\" as an exact phrase.",
        "Per-page meta remains consistent and meaningful for Services/Rate Card/Contact."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update global meta description/keywords to include the exact phrase “Bikaner delivery service” and keep titles/descriptions aligned with the refreshed brand."
        },
        {
          "path": "frontend/src/hooks/usePageMeta.ts",
          "operation": "modify",
          "description": "Extend per-page meta handling to also maintain a keywords meta tag (and ensure page descriptions stay meaningful and consistent for Services/Rate Card/Contact)."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update homepage meta title/description to include “Bikaner delivery service” in a natural, SEO-friendly way."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Update Services page meta title/description to remain consistent and include “Bikaner delivery service” where appropriate."
        },
        {
          "path": "frontend/src/pages/RateCardPage.tsx",
          "operation": "modify",
          "description": "Update Rate Card page meta title/description to remain consistent and include “Bikaner delivery service” where appropriate."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Confirm Google Maps embed layout remains responsive with no overflow on mobile and update meta title/description to include “Bikaner delivery service” where appropriate."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Update footer to include company name, phone & WhatsApp, website link, and service area text.",
      "acceptanceCriteria": [
        "Footer displays the specified company name and service area line exactly (case-insensitive acceptable except proper nouns).",
        "Footer includes clickable phone and WhatsApp links and a website link element."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Update footer content to include company name “Bikaner Express Delivery”, phone & WhatsApp links (from centralized config), a website link element, and the service area line “Serving Bikaner city, villages & dhanis”, while ensuring all footer copy is English."
        },
        {
          "path": "frontend/src/config/contact.ts",
          "operation": "modify",
          "description": "Ensure centralized contact config contains the phone number and WhatsApp number used by the footer and other CTAs, avoiding mismatches."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Add uploaded founder image as a static asset and use it in the Founder section with a graceful fallback.",
      "acceptanceCriteria": [
        "Founder section renders an image from a static asset path corresponding to the uploaded filename.",
        "If the image cannot be loaded, a styled placeholder is shown without breaking layout."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/1768716215296.jpg",
          "operation": "create",
          "description": "Add the uploaded image asset to the frontend public assets so it can be referenced by the Founder section."
        },
        {
          "path": "frontend/src/components/FounderCard.tsx",
          "operation": "modify",
          "description": "Wire the founder image to load from the static asset path (frontend/public/assets/1768716215296.jpg) and implement an onError fallback placeholder that preserves layout."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Ensure the homepage Founder section uses the FounderCard component that renders the uploaded founder photo with fallback behavior."
        }
      ]
    }
  ]
}